"use client"
import { Container, PageTitle, Section } from '@/shared/components';
import React, { useState } from 'react';
import QuestionsAnswersItem from './QuestionsAnswersItem';

type Question = {
  id: number;
  question: string;
  isOpen: boolean;
  text: string;
};

export default function QuestionsAnswersPage() {
  const [questions, setQuestions] = useState<Question[]>([
    {
      id: 1,
      question: 'Що таке СВІЙ маркетплейс?',
      text: `СВІЙ — інноваційний торговий майданчик. Це інтернет-платформа для місцевих продуктів харчування, де ми об'єднуємо виробників і споживачів. Тут вас чекають найсвіжіші та найсмачніші страви, вироблені нашими місцевими партнерами. Підтримуючи місцевих виробників, ми сприяємо розвитку нашої громади. Приєднуйтеся до нас, якщо ви цінуєте якість, унікальний смак та підтримку свого регіону. Ласкаво просимо в наш світ смаку та традицій!`,
      isOpen: false,
    },
    {
      id: 2,
      question: 'Що можна купити в СВІЙ?',
      text: 'СВІЙ пропонує широкий асортимент вишуканих продуктів харчування та напоїв, тощо. Наша увага зосереджена на наданні унікальних і високоякісних продуктів, які зазвичай не можна знайти в супермаркетах, включаючи спеціальні делікатеси, сир, м’ясо, випічку, шоколад, каву, чай, напої тощо. Ми віримо в підтримку місцевих виробників і допомагаємо їм охопити ширшу аудиторію. Роблячи покупки в СВІЙ, ви не лише отримуєте доступ до високоякісних унікальних продуктів, але й підтримуєте малий бізнес та економіку України.',
      isOpen: false,
    },
    {
      id: 3,
      question: 'Як СВІЙ доставляє?',
      text: 'Усі доставки організовуються продавцями, у яких ви замовляєте на СВІЙ. Час і вартість доставки залежать від продавця. Якщо у вашому кошику є кілька роздрібних продавців, плата за доставку стягуватиметься з кожного продавця, оскільки кожен роздрібний продавець доставлятиме свої товари окремо. Будь ласка, зверніть увагу, що час і вартість доставки можуть відрізнятися залежно від продавця та місця розташування, тому ми рекомендуємо уточнювати цю інформацію у продавців.',
      isOpen: false,
    },
    {
      id: 4,
      question: 'Питання щодо замовлення?',
      text: 'Якщо у вас виникли запитання щодо замовлення, зверніться безпосередньо до відповідного продавця. Зверніть увагу, що замовлення не можна змінити після розміщення. Однак, якщо вам потрібно скасувати своє замовлення, зв’яжіться безпосередньо з відповідним продавцем принаймні за два робочі дні до дати доставки або отримання. Якщо ваша посилка вже відправлена, замовлення не можна скасувати, і з вас буде стягнено плату за доставку та повернення. Для повернення або відшкодування зверніться до відповідного продавця, і він із задоволенням допоможе вам.',
      isOpen: false,
    },
  ]);

  const toggleQuestion = (id: number) => {
    setQuestions(prevQuestions =>
      prevQuestions.map(q =>
        q.id === id ? { ...q, isOpen: !q.isOpen } : { ...q, isOpen: false }
      )
    );
  };

  return (
    <Section className="pt-[32px] pb-16 md:pt-[64px] md:pb-[104px] xl:pt-[88px] xl:pb-[164px]">
      <PageTitle
        stylesPageTitle={'visually hidden'}
        name={'Питання і відповіді'}
      />
      <Container>
        <ul className="flex flex-col gap-4 md:gap-5 xl:pl-[109px]">
          {questions.map(q => (
            <QuestionsAnswersItem
              key={q.id.toString()}
              question={q}
              toggleQuestion={toggleQuestion}
            />
          ))}
        </ul>
      </Container>
    </Section>
  );
}
