const descriptionData = [
  {
    id: 0,
    description: `Якщо хочете спробувати щось оригінальне, то це джем з винограду з червоним вином. Мармеладна консистенція не залишить вас байдужими, нотка десертного червоного вина тільки підкреслить достаток смаку цього чудесного джему.
    Склад: червоний сортовий виноград «Молдова», десертне мускатне вино, пектин, цукор, щастя. Не містить замінників і ГМО.
    Приготований згідно ТУ У 10.3-3375101273-001
    Маса нетто: 130 г +/- 2,5
    Термін зберігання: 12 місяців від дати, зазначеної на упаковці.
    Умови зберігання: при температурі від +5 С до + 25 ° С і відносній вологості не більше 75%`,
  },
];

export default descriptionData;
