const descriptionData = [
  {
    id: 1,
    description:
      'Якщо хочете спробувати щось оригінальне, то це джем з винограду з червоним вином. Мармеладна консистенція не залишить вас байдужими, нотка десертного червоного вина тільки підкреслить достаток смаку цього чудесного джему.',
    composition:
      'Склад: червоний сортовий виноград «Молдова», десертне мускатне вино, пектин, цукор, щастя. Не містить замінників і ГМО.',
    gost: 'Приготований згідно ТУ У 10.3-3375101273-001',
    weight: 'Маса нетто: 130 г +/- 2,5',
    shelfLife:
      'Термін зберігання: 12 місяців від дати, зазначеної на упаковці.',
    conditions:
      'Умови зберігання: при температурі від +5 С до + 25 ° С і відносній вологості не більше 75%',
  },
];

export default descriptionData;
