const categoriesData = [
  {
    id: 0,
    title: 'Фрукти, ягоди та овочі',
    subCategories: [
      { title: 'Овочі', items: ['Помідори', 'Огірки', 'Картопля', 'Буряк'] },
      {
        title: 'Фрукти',
        items: [
          'Яблука',
          'Персики',
          'Абрикоси',
          'Сливи',
          'Груші',
          'Кавуни',
          'Дині',
          'Апельсини',
          'Лимони',
        ],
      },
      {
        title: 'Ягоди',
        items: ['Смородина', 'Малина', 'Чорниця1', 'Чорниця2', 'Чорниця3'],
      },
    ],
  },
  {
    id: 1,
    title: 'Кулінарія',
    subCategories: [
      { title: 'Кулінарія 1', items: ['Блюдо 1', 'Блюдо 2', 'Блюдо 3'] },
      { title: 'Кулінарія 2', items: ['Блюдо 4', 'Блюдо 5', 'Блюдо 6'] },
    ],
  },
  { id: 2, title: 'Випічка' },
  { id: 3, title: 'Овочі' },
  { id: 4, title: 'Фрукти' },
  {
    id: 5,
    title: 'Мед та продукти бджільництва',
  },
  { id: 6, title: "М'ясо та м'ясні вироби" },
  { id: 7, title: 'Молочна продукція' },
  { id: 8, title: 'Риба та морепродукти' },
  { id: 9, title: 'Яйця та птиця' },
  { id: 10, title: 'Зернові та бобові' },
  { id: 11, title: 'Горіхи та сухофрукти' },
  { id: 12, title: 'Консервовані продукти' },
  // {
  //   id: 0,
  //   title: 'Фрукти, ягоди та овочі',
  //   subCategories: [
  //     { title: 'Овочі', items: ['Помідори', 'Огірки', 'Картопля', 'Буряк'] },
  //     {
  //       title: 'Фрукти',
  //       items: [
  //         'Яблука',
  //         'Персики',
  //         'Абрикоси',
  //         'Сливи',
  //         'Груші',
  //         'Кавуни',
  //         'Дині',
  //         'Апельсини',
  //         'Лимони',
  //       ],
  //     },
  //     {
  //       title: 'Ягоди',
  //       items: ['Смородина', 'Малина', 'Чорниця1', 'Чорниця2', 'Чорниця3'],
  //     },
  //   ],
  // },
  // {
  //   id: 1,
  //   title: 'Кулінарія',
  //   subCategories: [
  //     { title: 'Кулінарія 1', items: ['Блюдо 1', 'Блюдо 2', 'Блюдо 3'] },
  //     { title: 'Кулінарія 2', items: ['Блюдо 4', 'Блюдо 5', 'Блюдо 6'] },
  //   ],
  // },
  // { id: 2, title: 'Випічка' },
  // { id: 3, title: 'Овочі' },
  // { id: 4, title: 'Фрукти' },
  // {
  //   id: 5,
  //   title: 'Мед та продукти бджільництва',
  // },
  // { id: 6, title: "М'ясо та м'ясні вироби" },
  // { id: 7, title: 'Молочна продукція' },
  // { id: 8, title: 'Риба та морепродукти' },
  // { id: 9, title: 'Яйця та птиця' },
  // { id: 10, title: 'Зернові та бобові' },
  // { id: 11, title: 'Горіхи та сухофрукти' },
  // { id: 12, title: 'Консервовані продукти' },
];

export default categoriesData;
