const categoriesData = [
  {
    id: 0,
    category: 'Фрукти, ягоди та овочі',
    subCategories: [
      { title: 'Овочі', items: ['Помідори', 'Огірки', 'Картопля', 'Буряк'] },
      {
        title: 'Фрукти',
        items: [
          'Яблука',
          'Персики',
          'Абрикоси',
          'Сливи',
          'Груші',
          'Кавуни',
          'Дині',
          'Апельсини',
          'Лимони',
        ],
      },
      {
        title: 'Ягоди',
        items: ['Смородина', 'Малина', 'Чорниця1', 'Чорниця2', 'Чорниця3'],
      },
    ],
  },
  {
    id: 1,
    category: 'Кулінарія',
    subCategories: [
      { title: 'Кулінарія 1', items: ['Блюдо 1', 'Блюдо 2', 'Блюдо 3'] },
      { title: 'Кулінарія 2', items: ['Блюдо 4', 'Блюдо 5', 'Блюдо 6'] },
    ],
  },
  { id: 2, category: 'Випічка' },
  { id: 3, category: 'Овочі' },
  { id: 4, category: 'Фрукти' },
  {
    id: 5,
    category: 'Мед та продукти бджільництва',
  },
  { id: 6, category: "М'ясо та м'ясні вироби" },
  { id: 7, category: 'Молочна продукція' },
  { id: 8, category: 'Риба та морепродукти' },
  { id: 9, category: 'Яйця та птиця' },
  { id: 10, category: 'Зернові та бобові' },
  { id: 11, category: 'Горіхи та сухофрукти' },
  { id: 12, category: 'Консервовані продукти' },
  {
    id: 0,
    category: 'Фрукти, ягоди та овочі',
    subCategories: [
      { title: 'Овочі', items: ['Помідори', 'Огірки', 'Картопля', 'Буряк'] },
      {
        title: 'Фрукти',
        items: [
          'Яблука',
          'Персики',
          'Абрикоси',
          'Сливи',
          'Груші',
          'Кавуни',
          'Дині',
          'Апельсини',
          'Лимони',
        ],
      },
      {
        title: 'Ягоди',
        items: ['Смородина', 'Малина', 'Чорниця1', 'Чорниця2', 'Чорниця3'],
      },
    ],
  },
  {
    id: 1,
    category: 'Кулінарія',
    subCategories: [
      { title: 'Кулінарія 1', items: ['Блюдо 1', 'Блюдо 2', 'Блюдо 3'] },
      { title: 'Кулінарія 2', items: ['Блюдо 4', 'Блюдо 5', 'Блюдо 6'] },
    ],
  },
  { id: 2, category: 'Випічка' },
  { id: 3, category: 'Овочі' },
  { id: 4, category: 'Фрукти' },
  {
    id: 5,
    category: 'Мед та продукти бджільництва',
  },
  { id: 6, category: "М'ясо та м'ясні вироби" },
  { id: 7, category: 'Молочна продукція' },
  { id: 8, category: 'Риба та морепродукти' },
  { id: 9, category: 'Яйця та птиця' },
  { id: 10, category: 'Зернові та бобові' },
  { id: 11, category: 'Горіхи та сухофрукти' },
  { id: 12, category: 'Консервовані продукти' },
];

export default categoriesData;
